[
  {
    "id": "hv9Btixa",
    "type": "webpage",
    "title": "Home Page",
    "URL": "https://doi.org/",
    "accessed": {
      "date-parts": [
        [
          "2023",
          12,
          6
        ]
      ]
    },
    "DOI": "",
    "note": "This CSL Item was generated by Manubot v0.5.6 from its persistent identifier (standard_id).\nstandard_id: doi:"
  },
  {
    "publisher": "Oxford University Press (OUP)",
    "issue": "6",
    "abstract": "<jats:title>Abstract</jats:title>\n               <jats:p>Motivation: Counting the number of occurrences of every k-mer (substring of length k) in a long string is a central subproblem in many applications, including genome assembly, error correction of sequencing reads, fast multiple sequence alignment and repeat detection. Recently, the deep sequence coverage generated by next-generation sequencing technologies has caused the amount of sequence to be processed during a genome project to grow rapidly, and has rendered current k-mer counting tools too slow and memory intensive. At the same time, large multicore computers have become commonplace in research facilities allowing for a new parallel computational paradigm.</jats:p>\n               <jats:p>Results: We propose a new k-mer counting algorithm and associated implementation, called Jellyfish, which is fast and memory efficient. It is based on a multithreaded, lock-free hash table optimized for counting k-mers up to 31 bases in length. Due to their flexibility, suffix arrays have been the data structure of choice for solving many string problems. For the task of k-mer counting, important in many biological applications, Jellyfish offers a much faster and more memory-efficient solution.</jats:p>\n               <jats:p>Availability: The Jellyfish software is written in C++ and is GPL licensed. It is available for download at http://www.cbcb.umd.edu/software/jellyfish.</jats:p>\n               <jats:p>Contact:  gmarcais@umd.edu</jats:p>\n               <jats:p>Supplementary information:  Supplementary data are available at Bioinformatics online.</jats:p>",
    "DOI": "10.1093/bioinformatics/btr011",
    "type": "article-journal",
    "page": "764-770",
    "source": "Crossref",
    "title": "A fast, lock-free approach for efficient parallel counting of occurrences of <i>k</i>-mers",
    "volume": "27",
    "author": [
      {
        "given": "Guillaume",
        "family": "Marçais"
      },
      {
        "given": "Carl",
        "family": "Kingsford"
      }
    ],
    "container-title": "Bioinformatics",
    "language": "en",
    "issued": {
      "date-parts": [
        [
          2011,
          1,
          7
        ]
      ]
    },
    "URL": "https://doi.org/b7gkd6",
    "PMCID": "PMC3051319",
    "PMID": "21217122",
    "id": "14dfsRv4c",
    "note": "This CSL Item was generated by Manubot v0.5.6 from its persistent identifier (standard_id).\nstandard_id: doi:10.1093/bioinformatics/btr011"
  }
]
